tap "homebrew/bundle"

brew "clang-format"
brew "cmake"
brew "fd"
brew "sdl2"
brew "gawk"
brew "git"
brew "ninja"
brew "python@3.12"
brew "qt"
brew "opencv"
brew "ripgrep"

cask "mactex"
cask "mpv"
cask "qbittorrent"
cask "qt-creator"
cask "texmaker"
cask "visual-studio-code"
