tap "homebrew/bundle"
tap "homebrew/cask-fonts"
brew "python@3.12"
brew "clang-format"
brew "cmake"
brew "fd"
brew "sdl2"
brew "gawk"
brew "git"
brew "ninja"
brew "qt"
brew "opencv"
brew "pre-commit"
brew "ripgrep"
brew "starship"
cask "docker"
cask "font-iosevka"
cask "font-iosevka-nerd-font"
cask "iterm2"
cask "mactex"
cask "mpv"
cask "notion"
cask "qbittorrent"
cask "qt-creator"
cask "spotify"
cask "sublime-text"
cask "texmaker"
cask "visual-studio-code"
vscode "ansonyeung.pascal-language-basics"
vscode "cheshirekow.cmake-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "hediet.vscode-drawio"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "maattdd.gitless"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.autopep8"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.powershell"
vscode "njpwerner.autodocstring"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "tamasfe.even-better-toml"
vscode "twxs.cmake"
vscode "vadimcn.vscode-lldb"
vscode "xaver.clang-format"
